InformationRegisters/ОкладыСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОкладыСотрудников</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Оклад</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/РаботаСоСотрудниками/Ext/Module.bsl
Функция ПолучитьОкладСотрудника(Сотрудник, ДатаЗначения) Экспорт
    Отбор = Новый Структура;
    Отбор.Вставить("Сотрудник", Сотрудник);

	Запись = РегистрыСведений.ОкладыСотрудников.ПолучитьПоследнее(ДатаЗначения, Отбор);

    Если Запись = Неопределено Тогда
        Возврат 0;     Иначе
        Возврат Запись.Оклад;
    КонецЕсли;

КонецФункции
